let CIDRASN = (externaldata (CIDR:string, CIDRASN:int, CIDRASNName:string)
['https://firewalliplists.gypthecat.com/lists/kusto/kusto-cidr-asn.csv.zip']
with (ignoreFirstRecord=true));
let IPs = datatable (IP:string)
[
"x.x.x.x"
];
DeviceNetworkEvents
| where RemoteIP in (IPs)
| where Timestamp >ago(30d)
| evaluate ipv4_lookup(CIDRASN, RemoteIP, CIDR)
| extend GeoIPData = geo_info_from_ip_address(RemoteIP)
