let emails = EmailEvents
| where RecipientEmailAddress == "bh-phishing@bluehalo.com" and Subject startswith "Phishing:" and Subject !startswith "Phishing:[REMEDIAL TRAINING]" and Subject != "Phishing:[EXTERNAL] - Microsoft 365 security: You have messages in quarantine"
| extend subnoext=replace_string(Subject,"Phishing:[EXTERNAL]","")
| extend sh1=substring(subnoext, 0, strlen(subnoext)/2), sh2=substring(subnoext, strlen(subnoext)/2);
emails
| summarize Count1=count() by sh1
| where Count1 > 2
| join kind=inner (emails) on $left.sh1 == $right.sh1
| union (
emails
| summarize Count2=count() by sh2
| where Count2 > 2
| join kind=inner (emails) on $left.sh2 == $right.sh2)
