//Title: Potential Outlook Home Page Attack
//Status: EXPERIMENTAL
//Description: This alert is triggered if a URL value is added to any outlook registry keys listed in the query. 
//             This may be indicative of a potential Outlook home page attack.
//References: 
//  https://trustedsec.com/blog/specula-turning-outlook-into-a-c2-with-one-registry-change
//  https://cloud.google.com/blog/topics/threat-intelligence/breaking-the-rules-tough-outlook-for-home-page-attacks/
//Author: CyberSpooon
//Created: 2024/08/01
//Modified: 2024/08/01
//Tags:
//  attack.persistence
//  attack.T1137.004
//Falsepositives: 
//------------------------------------------------------------------
DeviceRegistryEvents
| where Timestamp >= ago(1d)
| where 
//List of registry keys used in Outlook homepage attacks
    RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Inbox"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Calendar"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Contacts"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Deleted Items"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Drafts"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Journal"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Junk E-mail"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Notes"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Outbox"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\RSS"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Sent Mail"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\16.0\\Outlook\\WebView\\Tasks"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\16.0\\Outlook\\Today"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Inbox"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Calendar"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Contacts"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Deleted Items"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Drafts"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Journal"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Junk E-mail"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Notes"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Outbox"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\RSS"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Sent Mail"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\15.0\\Outlook\\WebView\\Tasks"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\15.0\\Outlook\\Today"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Inbox"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Calendar"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Contacts"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Deleted Items"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Drafts"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Journal"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Junk E-mail"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Notes"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Outbox"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\RSS"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Sent Mail"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\14.0\\Outlook\\WebView\\Tasks"
    or RegistryKey matches regex @"HKEY_CURRENT_USER\\(.*?)\\Software\\Microsoft\\Office\\14.0\\Outlook\\Today"
| where ActionType == "RegistryValueSet" and RegistryValueData contains @"http://"
